/* automatically generated by rust-bindgen 0.72.1 */

unsafe extern "C" {
    pub fn clib_add_two_ulong(
        x: ::core::ffi::c_ulong,
        y: ::core::ffi::c_ulong,
    ) -> ::core::ffi::c_ulong;
}
unsafe extern "C" {
    pub fn clib_add_two_float(x: f32, y: f32) -> f32;
}
unsafe extern "C" {
    pub fn clib_add_two_double(x: f64, y: f64) -> f64;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct data_t {
    pub x: ::core::ffi::c_uchar,
    pub y: f64,
    pub z: ::core::ffi::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of data_t"][::core::mem::size_of::<data_t>() - 24usize];
    ["Alignment of data_t"][::core::mem::align_of::<data_t>() - 8usize];
    ["Offset of field: data_t::x"][::core::mem::offset_of!(data_t, x) - 0usize];
    ["Offset of field: data_t::y"][::core::mem::offset_of!(data_t, y) - 8usize];
    ["Offset of field: data_t::z"][::core::mem::offset_of!(data_t, z) - 16usize];
};
unsafe extern "C" {
    pub fn get_int_field(ptr: *mut data_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn get_double_field(ptr: *mut data_t) -> f64;
}
